app/controllers/vehicles_controller.rb

  def used_car
    session[:clearance_center] = nil
    @vehicle_make = VehicleMake.find(:all, :order => "name ASC")
---
SELECT `vehicle_makes`.id FROM `vehicle_makes` WHERE (`vehicle_makes`.`name` = BINARY 'Acura') LIMIT 1